/*:
 * @plugindesc ウィンドウ開閉アニメ調整プラグイン
 * @author Eiten
 * @help ウィンドウ開閉時のアニメーションをカットします
 *このプラグインにプラグインンコマンドはありません
 *
 * 利用規約：
 *  作者に無断で改変、再配布が可能です、利用形態（商用、18禁利用等）
 *  についても制限はありません。
 *  このプラグインは自由にお使いください。
 *  しかし、自作発言と有償再配布はやめてくださいね。
 */

(function() {Window_Base.prototype.updateOpen = function() {
    if (this._opening) {
        this.openness += 255;
        /*
        ウィンドウの"展開後の縦サイズ"を255として、この数値を加算してウィンドウを拡大している。
        255指定で１フレームで最大サイズになるので実質アニメーションなしとなる
        */
        if (this.isOpen()) {
            this._opening = false;
        }
    }
};

Window_Base.prototype.updateClose = function() {
    if (this._closing) {
        this.openness -= 255;
        /*
        ウィンドウの"展開後の縦サイズ"を255として、この数値を減算してウィンドウを縮小している。
        255指定で１フレームで最大サイズになるので実質アニメーションなしとなる
        ちなみに極端にゆっくりにしても次のイベント処理は即座に開始される
        また、同じウィンドウ(選択肢ウィンドウなど)が閉じきる前に開かれた場合
        閉じかけのサイズから展開が始まる
        */
        if (this.isClosed()) {
            this._closing = false;
        }
    }
};
})();